<template><h1 id="设计原则" tabindex="-1"><a class="header-anchor" href="#设计原则" aria-hidden="true">#</a> 设计原则</h1>
<h2 id="专注寻找真正的问题和适合的解决方案" tabindex="-1"><a class="header-anchor" href="#专注寻找真正的问题和适合的解决方案" aria-hidden="true">#</a> 专注寻找真正的问题和适合的解决方案</h2>
<p>①明确问题，了解用户需求，为谁而设计
先确定优先级，前期了解谁看这些数据，针对数据的目标对象达成共识，满足受众的利益和需求。</p>
<p>②了解受众对可视化的熟悉成度，设计符合实际，切勿天马行空
如果他们是新手，请坚持使用传统图表，例如饼图，条形图和折线图，否则，他们将花费更多时间在图表的新颖性上，而不是关注图表中包含的信息。还需要考虑到前端的实现和数据特殊情况下的样式展现方式。</p>
<h2 id="给用户足够的思考空间" tabindex="-1"><a class="header-anchor" href="#给用户足够的思考空间" aria-hidden="true">#</a> 给用户足够的思考空间</h2>
<p>在不扭曲数据故事前提下，完美的数据可视化是激起好奇心与求知欲的，始终坚持给用户超出期待的作品，体验在数据世界中的漫游之美。</p>
<h2 id="对可发生风险保持谨慎态度" tabindex="-1"><a class="header-anchor" href="#对可发生风险保持谨慎态度" aria-hidden="true">#</a> 对可发生风险保持谨慎态度</h2>
<p>我们并不强调固步自封、避免创新，相反我们鼓励创新与挑战自我，但要明确知悉可视化系统带来的风险与创新所带来的风险，并对风险保持谨慎保守的态度。</p>
<h2 id="展示数据变化而非设计变化" tabindex="-1"><a class="header-anchor" href="#展示数据变化而非设计变化" aria-hidden="true">#</a> 展示数据变化而非设计变化</h2>
<p>①知道自己该如何表达和展示设计效果，找出核心
简单易懂，不要让用户“解读”信息，要通过聚焦所呈现的数据来传达一个强有力的信息，以确保一个中心主题的出现。</p>
<p>②基于背景信息内容，减少过度设计导致的数据误读；同时考虑数据的不确定性和可变性，设计变化服务于数据变化。</p>
<h2 id="创造并批判" tabindex="-1"><a class="header-anchor" href="#创造并批判" aria-hidden="true">#</a> 创造并批判</h2>
<p>始终以辩证的眼光看待可视化设计，自我审视、发现问题、解决问题，如此反复。可视化设计是循序向前、反复迭代的，创造并批判，使设计过程更加严谨、全面、客观。</p>
<h2 id="合理设定数据密度及数据矩阵范围" tabindex="-1"><a class="header-anchor" href="#合理设定数据密度及数据矩阵范围" aria-hidden="true">#</a> 合理设定数据密度及数据矩阵范围</h2>
<p>①文字与表格和图表和理解结合
a)有意义的应用文本，不要一次性给用户提供太多的文字信息。通过选择适当的视觉效果，使他们能够轻松地识别。让人们更容易看到图表和文字的互动。合理的文本摆放助于增加理解，而不减损视觉的意义。
b)在有限页面中展示大体量数据，信息表述维度不应超过数据数字维度，充分考虑相关性、对比性、</p>
<p>②差异性，揭示数据多层次细节以及展示整体概览，有效集成统计分析、艺术设计以及可视化客观性为一体。</p>
<h2 id="没有无用的数据-只有无意义的解读" tabindex="-1"><a class="header-anchor" href="#没有无用的数据-只有无意义的解读" aria-hidden="true">#</a> 没有无用的数据，只有无意义的解读</h2>
<p>①在数据可视化设计无法解决当前用户问题时，在怀疑数据有效性前，先审视数据展示视角。
角的选取影响数据分析的信息传达，尤其在数据点构成数据集的过程里，有时可以通过解构手法，发现数据的规律。</p>
<p>②合理运用点线面相结合的设计原则
利用点的聚集和分散性、线的指引性、面的切割性，来增强设计的空间感和科技感，同时控制数量和层次，以免画面凌乱。</p>
</template>
